node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 48293
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 48293
          }
        }
        string_val: "cropped_set/Image/train/0--Parade/2260.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2803.jpg"
        string_val: "cropped_set/Image/train/0--Parade/320.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2594.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2142.jpg"
        string_val: "cropped_set/Image/train/0--Parade/240.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1869.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2805.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1088.jpg"
        string_val: "cropped_set/Image/train/0--Parade/930.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1827.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1831.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1431.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2306.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1443.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2128.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2349.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1891.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1599.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2795.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1490.jpg"
        string_val: "cropped_set/Image/train/0--Parade/812.jpg"
        string_val: "cropped_set/Image/train/0--Parade/926.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1388.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2714.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1008.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2127.jpg"
        string_val: "cropped_set/Image/train/0--Parade/742.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2337.jpg"
        string_val: "cropped_set/Image/train/0--Parade/265.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2951.jpg"
        string_val: "cropped_set/Image/train/0--Parade/904.jpg"
        string_val: "cropped_set/Image/train/0--Parade/573.jpg"
        string_val: "cropped_set/Image/train/0--Parade/569.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2179.jpg"
        string_val: "cropped_set/Image/train/0--Parade/433.jpg"
        string_val: "cropped_set/Image/train/0--Parade/668.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1596.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1911.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2873.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1641.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1489.jpg"
        string_val: "cropped_set/Image/train/0--Parade/343.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1174.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2228.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1870.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1651.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1560.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1708.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2496.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1147.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2490.jpg"
        string_val: "cropped_set/Image/train/0--Parade/345.jpg"
        string_val: "cropped_set/Image/train/0--Parade/318.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1457.jpg"
        string_val: "cropped_set/Image/train/0--Parade/648.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1144.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1538.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2620.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1872.jpg"
        string_val: "cropped_set/Image/train/0--Parade/689.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1993.jpg"
        string_val: "cropped_set/Image/train/0--Parade/829.jpg"
        string_val: "cropped_set/Image/train/0--Parade/295.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1165.jpg"
        string_val: "cropped_set/Image/train/0--Parade/383.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1152.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2020.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1504.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1056.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2355.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1129.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2661.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1765.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2900.jpg"
        string_val: "cropped_set/Image/train/0--Parade/771.jpg"
        string_val: "cropped_set/Image/train/0--Parade/532.jpg"
        string_val: "cropped_set/Image/train/0--Parade/373.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2118.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2498.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2371.jpg"
        string_val: "cropped_set/Image/train/0--Parade/748.jpg"
        string_val: "cropped_set/Image/train/0--Parade/57.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1787.jpg"
        string_val: "cropped_set/Image/train/0--Parade/630.jpg"
        string_val: "cropped_set/Image/train/0--Parade/858.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2386.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2471.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1415.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2938.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2273.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1317.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1010.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1581.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2834.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2814.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1503.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1000.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2088.jpg"
        string_val: "cropped_set/Image/train/0--Parade/565.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2560.jpg"
        string_val: "cropped_set/Image/train/0--Parade/294.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1680.jpg"
        string_val: "cropped_set/Image/train/0--Parade/84.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2046.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1868.jpg"
        string_val: "cropped_set/Image/train/0--Parade/262.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1729.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2652.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1466.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2725.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1149.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1991.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2926.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2923.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2061.jpg"
        string_val: "cropped_set/Image/train/0--Parade/91.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2104.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1672.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1229.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1171.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1994.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2726.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2342.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1744.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2430.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2546.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2729.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1059.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1358.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2172.jpg"
        string_val: "cropped_set/Image/train/0--Parade/212.jpg"
        string_val: "cropped_set/Image/train/0--Parade/966.jpg"
        string_val: "cropped_set/Image/train/0--Parade/494.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1365.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1551.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1312.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1182.jpg"
        string_val: "cropped_set/Image/train/0--Parade/946.jpg"
        string_val: "cropped_set/Image/train/0--Parade/100.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2422.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2407.jpg"
        string_val: "cropped_set/Image/train/0--Parade/112.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1448.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1140.jpg"
        string_val: "cropped_set/Image/train/0--Parade/860.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2796.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2611.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1417.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1293.jpg"
        string_val: "cropped_set/Image/train/0--Parade/405.jpg"
        string_val: "cropped_set/Image/train/0--Parade/34.jpg"
        string_val: "cropped_set/Image/train/0--Parade/215.jpg"
        string_val: "cropped_set/Image/train/0--Parade/925.jpg"
        string_val: "cropped_set/Image/train/0--Parade/640.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2064.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2850.jpg"
        string_val: "cropped_set/Image/train/0--Parade/603.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1715.jpg"
        string_val: "cropped_set/Image/train/0--Parade/767.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2682.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1361.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1428.jpg"
        string_val: "cropped_set/Image/train/0--Parade/374.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1353.jpg"
        string_val: "cropped_set/Image/train/0--Parade/164.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1285.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2575.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2589.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1912.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1187.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1200.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2635.jpg"
        string_val: "cropped_set/Image/train/0--Parade/661.jpg"
        string_val: "cropped_set/Image/train/0--Parade/882.jpg"
        string_val: "cropped_set/Image/train/0--Parade/958.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1642.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1536.jpg"
        string_val: "cropped_set/Image/train/0--Parade/210.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1968.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2781.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2466.jpg"
        string_val: "cropped_set/Image/train/0--Parade/806.jpg"
        string_val: "cropped_set/Image/train/0--Parade/189.jpg"
        string_val: "cropped_set/Image/train/0--Parade/286.jpg"
        string_val: "cropped_set/Image/train/0--Parade/717.jpg"
        string_val: "cropped_set/Image/train/0--Parade/306.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2269.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1251.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1620.jpg"
        string_val: "cropped_set/Image/train/0--Parade/789.jpg"
        string_val: "cropped_set/Image/train/0--Parade/48.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1045.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2723.jpg"
        string_val: "cropped_set/Image/train/0--Parade/938.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1359.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2872.jpg"
        string_val: "cropped_set/Image/train/0--Parade/547.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2876.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2259.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2952.jpg"
        string_val: "cropped_set/Image/train/0--Parade/109.jpg"
        string_val: "cropped_set/Image/train/0--Parade/981.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1226.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1666.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2175.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2928.jpg"
        string_val: "cropped_set/Image/train/0--Parade/637.jpg"
        string_val: "cropped_set/Image/train/0--Parade/683.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2356.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2044.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1419.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1731.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1487.jpg"
        string_val: "cropped_set/Image/train/0--Parade/246.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2685.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2640.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1898.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2152.jpg"
        string_val: "cropped_set/Image/train/0--Parade/437.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1846.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1851.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1936.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1721.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1996.jpg"
        string_val: "cropped_set/Image/train/0--Parade/409.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1725.jpg"
        string_val: "cropped_set/Image/train/0--Parade/870.jpg"
        string_val: "cropped_set/Image/train/0--Parade/880.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1524.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2094.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1737.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2571.jpg"
        string_val: "cropped_set/Image/train/0--Parade/815.jpg"
        string_val: "cropped_set/Image/train/0--Parade/472.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1127.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1889.jpg"
        string_val: "cropped_set/Image/train/0--Parade/797.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1014.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1115.jpg"
        string_val: "cropped_set/Image/train/0--Parade/576.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1156.jpg"
        string_val: "cropped_set/Image/train/0--Parade/148.jpg"
        string_val: "cropped_set/Image/train/0--Parade/649.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2499.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1245.jpg"
        string_val: "cropped_set/Image/train/0--Parade/962.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2748.jpg"
        string_val: "cropped_set/Image/train/0--Parade/280.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1243.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1771.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2935.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2271.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2397.jpg"
        string_val: "cropped_set/Image/train/0--Parade/448.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2485.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2230.jpg"
        string_val: "cropped_set/Image/train/0--Parade/455.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1735.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1126.jpg"
        string_val: "cropped_set/Image/train/0--Parade/283.jpg"
        string_val: "cropped_set/Image/train/0--Parade/463.jpg"
        string_val: "cropped_set/Image/train/0--Parade/993.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2528.jpg"
        string_val: "cropped_set/Image/train/0--Parade/323.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2590.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1462.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1339.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1343.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2556.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2523.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2076.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2730.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1032.jpg"
        string_val: "cropped_set/Image/train/0--Parade/434.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2299.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1288.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1659.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1932.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1634.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1900.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1957.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1439.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2492.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1658.jpg"
        string_val: "cropped_set/Image/train/0--Parade/665.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2257.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2842.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2457.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2423.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1923.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1614.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2245.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2686.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2917.jpg"
        string_val: "cropped_set/Image/train/0--Parade/991.jpg"
        string_val: "cropped_set/Image/train/0--Parade/54.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2221.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1060.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2414.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1076.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2755.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1495.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2032.jpg"
        string_val: "cropped_set/Image/train/0--Parade/896.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1584.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2332.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2859.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1828.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1436.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2382.jpg"
        string_val: "cropped_set/Image/train/0--Parade/642.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1506.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1319.jpg"
        string_val: "cropped_set/Image/train/0--Parade/4.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2433.jpg"
        string_val: "cropped_set/Image/train/0--Parade/765.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2052.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2773.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1411.jpg"
        string_val: "cropped_set/Image/train/0--Parade/890.jpg"
        string_val: "cropped_set/Image/train/0--Parade/420.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1973.jpg"
        string_val: "cropped_set/Image/train/0--Parade/446.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2657.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2931.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2961.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1498.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2514.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2631.jpg"
        string_val: "cropped_set/Image/train/0--Parade/471.jpg"
        string_val: "cropped_set/Image/train/0--Parade/184.jpg"
        string_val: "cropped_set/Image/train/0--Parade/571.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1670.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2231.jpg"
        string_val: "cropped_set/Image/train/0--Parade/123.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2312.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2956.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2302.jpg"
        string_val: "cropped_set/Image/train/0--Parade/142.jpg"
        string_val: "cropped_set/Image/train/0--Parade/699.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2215.jpg"
        string_val: "cropped_set/Image/train/0--Parade/544.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2174.jpg"
        string_val: "cropped_set/Image/train/0--Parade/456.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1597.jpg"
        string_val: "cropped_set/Image/train/0--Parade/101.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2527.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2322.jpg"
        string_val: "cropped_set/Image/train/0--Parade/803.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1712.jpg"
        string_val: "cropped_set/Image/train/0--Parade/275.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2284.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2148.jpg"
        string_val: "cropped_set/Image/train/0--Parade/205.jpg"
        string_val: "cropped_set/Image/train/0--Parade/5.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1425.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1068.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1274.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2239.jpg"
        string_val: "cropped_set/Image/train/0--Parade/196.jpg"
        string_val: "cropped_set/Image/train/0--Parade/893.jpg"
        string_val: "cropped_set/Image/train/0--Parade/277.jpg"
        string_val: "cropped_set/Image/train/0--Parade/891.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1513.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1379.jpg"
        string_val: "cropped_set/Image/train/0--Parade/180.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2451.jpg"
        string_val: "cropped_set/Image/train/0--Parade/273.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2477.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1371.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1946.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2112.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2869.jpg"
        string_val: "cropped_set/Image/train/0--Parade/159.jpg"
        string_val: "cropped_set/Image/train/0--Parade/396.jpg"
        string_val: "cropped_set/Image/train/0--Parade/793.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2868.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1677.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1413.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2718.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2855.jpg"
        string_val: "cropped_set/Image/train/0--Parade/762.jpg"
        string_val: "cropped_set/Image/train/0--Parade/285.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1212.jpg"
        string_val: "cropped_set/Image/train/0--Parade/162.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1701.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1401.jpg"
        string_val: "cropped_set/Image/train/0--Parade/757.jpg"
        string_val: "cropped_set/Image/train/0--Parade/349.jpg"
        string_val: "cropped_set/Image/train/0--Parade/333.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1082.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1679.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2531.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1316.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1558.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2746.jpg"
        string_val: "cropped_set/Image/train/0--Parade/819.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1631.jpg"
        string_val: "cropped_set/Image/train/0--Parade/311.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2586.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2704.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2249.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2681.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1988.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2204.jpg"
        string_val: "cropped_set/Image/train/0--Parade/823.jpg"
        string_val: "cropped_set/Image/train/0--Parade/113.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1987.jpg"
        string_val: "cropped_set/Image/train/0--Parade/698.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2511.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1222.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1544.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1470.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1964.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1565.jpg"
        string_val: "cropped_set/Image/train/0--Parade/842.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1769.jpg"
        string_val: "cropped_set/Image/train/0--Parade/645.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1847.jpg"
        string_val: "cropped_set/Image/train/0--Parade/957.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1762.jpg"
        string_val: "cropped_set/Image/train/0--Parade/348.jpg"
        string_val: "cropped_set/Image/train/0--Parade/157.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2607.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1540.jpg"
        string_val: "cropped_set/Image/train/0--Parade/787.jpg"
        string_val: "cropped_set/Image/train/0--Parade/165.jpg"
        string_val: "cropped_set/Image/train/0--Parade/922.jpg"
        string_val: "cropped_set/Image/train/0--Parade/733.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2234.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1452.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1058.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2030.jpg"
        string_val: "cropped_set/Image/train/0--Parade/741.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2698.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1609.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1047.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2517.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1812.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1447.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2903.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1837.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2858.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2027.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2614.jpg"
        string_val: "cropped_set/Image/train/0--Parade/830.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1644.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2368.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2325.jpg"
        string_val: "cropped_set/Image/train/0--Parade/425.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1458.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2695.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2092.jpg"
        string_val: "cropped_set/Image/train/0--Parade/424.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2916.jpg"
        string_val: "cropped_set/Image/train/0--Parade/635.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2487.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1079.jpg"
        string_val: "cropped_set/Image/train/0--Parade/719.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1277.jpg"
        string_val: "cropped_set/Image/train/0--Parade/832.jpg"
        string_val: "cropped_set/Image/train/0--Parade/908.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2040.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1080.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2036.jpg"
        string_val: "cropped_set/Image/train/0--Parade/341.jpg"
        string_val: "cropped_set/Image/train/0--Parade/139.jpg"
        string_val: "cropped_set/Image/train/0--Parade/905.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2933.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1461.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1450.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2124.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1423.jpg"
        string_val: "cropped_set/Image/train/0--Parade/675.jpg"
        string_val: "cropped_set/Image/train/0--Parade/261.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2659.jpg"
        string_val: "cropped_set/Image/train/0--Parade/636.jpg"
        string_val: "cropped_set/Image/train/0--Parade/27.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1375.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1615.jpg"
        string_val: "cropped_set/Image/train/0--Parade/844.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1930.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2516.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1185.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2896.jpg"
        string_val: "cropped_set/Image/train/0--Parade/687.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2828.jpg"
        string_val: "cropped_set/Image/train/0--Parade/287.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1935.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2629.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2054.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1246.jpg"
        string_val: "cropped_set/Image/train/0--Parade/305.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2001.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2445.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1023.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1342.jpg"
        string_val: "cropped_set/Image/train/0--Parade/297.jpg"
        string_val: "cropped_set/Image/train/0--Parade/224.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1924.jpg"
        string_val: "cropped_set/Image/train/0--Parade/458.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2202.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2320.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2632.jpg"
        string_val: "cropped_set/Image/train/0--Parade/912.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2688.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2280.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2400.jpg"
        string_val: "cropped_set/Image/train/0--Parade/330.jpg"
        string_val: "cropped_set/Image/train/0--Parade/901.jpg"
        string_val: "cropped_set/Image/train/0--Parade/681.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1526.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2059.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1465.jpg"
        string_val: "cropped_set/Image/train/0--Parade/353.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1393.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2964.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2497.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1338.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1186.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2268.jpg"
        string_val: "cropped_set/Image/train/0--Parade/413.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2447.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1394.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1500.jpg"
        string_val: "cropped_set/Image/train/0--Parade/677.jpg"
        string_val: "cropped_set/Image/train/0--Parade/801.jpg"
        string_val: "cropped_set/Image/train/0--Parade/147.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1269.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2960.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2452.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1134.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2678.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1519.jpg"
        string_val: "cropped_set/Image/train/0--Parade/811.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1332.jpg"
        string_val: "cropped_set/Image/train/0--Parade/837.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1039.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1108.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2224.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2067.jpg"
        string_val: "cropped_set/Image/train/0--Parade/518.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1738.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2156.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1700.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2835.jpg"
        string_val: "cropped_set/Image/train/0--Parade/674.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1798.jpg"
        string_val: "cropped_set/Image/train/0--Parade/605.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2169.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2526.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1683.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1438.jpg"
        string_val: "cropped_set/Image/train/0--Parade/366.jpg"
        string_val: "cropped_set/Image/train/0--Parade/949.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1281.jpg"
        string_val: "cropped_set/Image/train/0--Parade/884.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1913.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1713.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1984.jpg"
        string_val: "cropped_set/Image/train/0--Parade/751.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1958.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2265.jpg"
        string_val: "cropped_set/Image/train/0--Parade/130.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2621.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2776.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1554.jpg"
        string_val: "cropped_set/Image/train/0--Parade/217.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1003.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2460.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2399.jpg"
        string_val: "cropped_set/Image/train/0--Parade/552.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2062.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1158.jpg"
        string_val: "cropped_set/Image/train/0--Parade/248.jpg"
        string_val: "cropped_set/Image/train/0--Parade/723.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2754.jpg"
        string_val: "cropped_set/Image/train/0--Parade/244.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1773.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1959.jpg"
        string_val: "cropped_set/Image/train/0--Parade/18.jpg"
        string_val: "cropped_set/Image/train/0--Parade/274.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2572.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1119.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1525.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2137.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2038.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2154.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2401.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2606.jpg"
        string_val: "cropped_set/Image/train/0--Parade/509.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1241.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1774.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1216.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2459.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2650.jpg"
        string_val: "cropped_set/Image/train/0--Parade/327.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2125.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1117.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2429.jpg"
        string_val: "cropped_set/Image/train/0--Parade/651.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2653.jpg"
        string_val: "cropped_set/Image/train/0--Parade/422.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1747.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2049.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2068.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1716.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2701.jpg"
        string_val: "cropped_set/Image/train/0--Parade/354.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1308.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1575.jpg"
        string_val: "cropped_set/Image/train/0--Parade/252.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2663.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1356.jpg"
        string_val: "cropped_set/Image/train/0--Parade/577.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1300.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1460.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2862.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2845.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2809.jpg"
        string_val: "cropped_set/Image/train/0--Parade/199.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2327.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2914.jpg"
        string_val: "cropped_set/Image/train/0--Parade/59.jpg"
        string_val: "cropped_set/Image/train/0--Parade/656.jpg"
        string_val: "cropped_set/Image/train/0--Parade/242.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2468.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1066.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1007.jpg"
        string_val: "cropped_set/Image/train/0--Parade/419.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2143.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1474.jpg"
        string_val: "cropped_set/Image/train/0--Parade/983.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2473.jpg"
        string_val: "cropped_set/Image/train/0--Parade/410.jpg"
        string_val: "cropped_set/Image/train/0--Parade/249.jpg"
        string_val: "cropped_set/Image/train/0--Parade/817.jpg"
        string_val: "cropped_set/Image/train/0--Parade/255.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2435.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1050.jpg"
        string_val: "cropped_set/Image/train/0--Parade/191.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2139.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1791.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1195.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1619.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1877.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2885.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1442.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1820.jpg"
        string_val: "cropped_set/Image/train/0--Parade/501.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2783.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2810.jpg"
        string_val: "cropped_set/Image/train/0--Parade/846.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1063.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2847.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1378.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2274.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1208.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1445.jpg"
        string_val: "cropped_set/Image/train/0--Parade/857.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1481.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1242.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1778.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1382.jpg"
        string_val: "cropped_set/Image/train/0--Parade/461.jpg"
        string_val: "cropped_set/Image/train/0--Parade/257.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2014.jpg"
        string_val: "cropped_set/Image/train/0--Parade/666.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1742.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1302.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2743.jpg"
        string_val: "cropped_set/Image/train/0--Parade/188.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1710.jpg"
        string_val: "cropped_set/Image/train/0--Parade/134.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1546.jpg"
        string_val: "cropped_set/Image/train/0--Parade/2159.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1239.jpg"
        string_val: "cropped_set/Image/train/0--Parade/1962.jpg"
